---
kind: method
id: M:Autodesk.Revit.DB.FilterStringRule.GetEvaluator
source: html/00247f33-3684-dc0e-e371-954d14c19536.htm
---
# Autodesk.Revit.DB.FilterStringRule.GetEvaluator Method

Gets the evaluator that implements the test for this rule.

## Syntax (C#)
```csharp
public FilterStringRuleEvaluator GetEvaluator()
```